test/solver/incompressibleFluid/cases/fvOptionsRow4Limited/constant/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

// `limitVelocity` is a *correction*: it contributes nothing to the momentum
// matrix and acts only through `fvOptions.correct(U)`, by scaling U down to
// `max` in magnitude on the `source` cellZone. That makes it the cleanest probe
// for whether the correction is called at all, and whether it is called *after*
// the momentum solve (before it, the solve would simply overwrite the clamp).
//
// The file lives in constant/ on purpose: fv::options searches constant/ first
// and system/ second, and the solver must find it in either place.

velocityLimit
{
    type            limitVelocity;

    selectionMode   cellZone;
    cellZone        source;

    max             1;
}
