test/solver/incompressibleFluid/cases/fvOptionsRow4Limited/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
        smoother        DICGaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    // The clamp is applied by fvOptions.correct(U), which native calls right
    // after the momentum solve -- so this case has to run that solve.
    momentumPredictor yes;
}
